Tekla Open API Reference for Tekla Structures 2025
BaseComponent.SetAttribute Method (String, String)
 Sets the attribute's value to the given value.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetAttribute(
	string AttrName,
	string StrValue
)
Public Sub SetAttribute (
	AttrName As String,
	StrValue As String
)
Parameters
AttrName
Type: System.String
The name of the attribute.
StrValue
Type: System.String
The string value of the attribute.
See Also
Reference
BaseComponent Class
SetAttribute Overload
Tekla.Structures.Model Namespace